{\"assignment-1-start\": \"return 'GO INSIDE. IT IS NOT SAFE OUTSIDE. BE A SPY STUDENT, PLEASE.';\",\"assignment-1-indoors\": \"return 'YOU DON\u0027T REALLY NEED HELP ALREADY, DO YOU?';\",\"assignment-1-i-am-trainee\": \"return 'DO NOT WORRY. THE FACILITY HAS BEEN THOROUGHLY CLEANED OF MUMPS AND POSES NO RISK WHATSOEVER TO YOUR HEALTH.';\",\"assignment-1-loadout-2\": \"return 'YOU ARE ABLE TO GO BACK UPSTAIRS WITHOUT A DEVICE, BUT NOTE THAT IF YOU CHOOSE TO BEGIN YOUR ASSIGNMENT WITHOUT HAVING SELECTED ONE, YOU WILL HAVE TO FIND A PIECE OF EQUIPMENT IN-MISSION TO PROGRESS.';\",\"assignment-1-loadout-3\": \"return 'SELECT YOUR CHOICE OF ANY WEAPON. EACH WILL HELP YOU TO COMPLETE YOUR FIRST MISSION IN DIFFERENT WAYS. (IF YOU WERE WONDERING, THE GUN IS DELIBERATELY IMPOSSIBLE TO PICK UP. YOU\u0027LL HAVE TO CHOOSE A DIFFERENT ITEM.)';\",\"...\": \"return 'THERE APPEARS TO BE A SLIGHT PROBLEM WITH THE GUN AT THE MOMENT. YOU WILL HAVE TO MAKE ANOTHER SELECTION.';\",\"assignment-1-horizon\": \"return 'THERE IS NOTHING OF INTEREST IN THIS DIRECTION. THE ONLY WAY TO GO IS FORWARD.';\",\"assignment-1-approach-1\": \"return 'IN ORDER TO PASS THIS AREA, WALK CLOSER. DO NOT PICK UP THE ROCK IN THIS PASSAGE, BECAUSE IT WILL EXPLODE AND KILL YOU.';\",\"assignment-1-fake-rock-pickup\": \"return 'THERE IS NOT A GREAT DEAL I CAN DO TO HELP YOU AT THIS POINT. YOU PICKED UP THE ROCK YOU WEREN\u0027T SUPPOSED TO PICK UP. NOW IT EXPLODED YOU AND YOU ARE DEAD. START OVER OR GO BACK, I GUESS.';\",\"assignment-1-approach-2\": \"return 'PICKING UP THE NORMAL ROCK WILL ENABLE YOU TO ENTER THE FACILITY. WALKING CLOSER WILL RESULT IN YOUR DEATH.';\",\"assignment-1-hallway\": \"return 'WALKING TOWARDS THE DATACORE BEFORE ENTERING THE BREAK ROOM WILL ALWAYS RESULT IN YOUR DEATH. THERE ARE THINGS YOU HAVE TO DO IN THE BREAK ROOM FIRST.';\",\"assignment-1-break-room\": \"switch (window.equipment) { case 'BANANA': return 'GO TO EAT THE BANANA BREAD, THEN HACK THE BANANA BREAD.'; case 'BRA': return 'SIT AT THE TABLE AND WAIT FOR THE HOT STUFF TO START'; case 'OATMEAL': return 'ENTER THE LOCKER, PLACE THE OATMEAL ON THE FLOOR, SIT AT THE TABLE.'; case 'NONE': return 'ENTER THE LOCKER, PUT ON THE BIRD SUIT, EXIT THE LOCKER, PUT THE SIGN ON THE DOOR, SIT AT THE TABLE.'; default: return 'IT LOOKS LIKE THE EQUIPMENT VARIABLE HAS AN UNEXPECTED VALUE! I DON\u0027T KNOW HOW THAT COULD\u0027VE HAPPENED, BUT YOU\u0027RE PROBABLY BETTER OFF RESTARTING YOUR GAME.'; }\"}
